#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.okta_app_group_lambda.local_file.placeholder_code: Refreshing state... [id=fb06c549e1e895bd4cd2bb65d4ec43f4e085d936]
aws_ssm_parameter.app_context: Refreshing state... [id=/hagrid/app-context]
module.okta_app_group_lambda.aws_iam_role.lambda_role: Refreshing state... [id=hagrid-okta-app-group-lambda-role]
aws_ssm_parameter.okta_credentials: Refreshing state... [id=/hagrid/okta-credentials]
module.okta_app_group_lambda.aws_iam_role_policy.lambda_okta_credentials: Refreshing state... [id=hagrid-okta-app-group-lambda-role:hagrid-okta-lambda-credentials]
module.okta_app_group_lambda.aws_iam_role_policy.lambda_ssm: Refreshing state... [id=hagrid-okta-app-group-lambda-role:hagrid-okta-lambda-ssm]
module.okta_app_group_lambda.aws_lambda_function.okta_app_group_updater: Refreshing state... [id=hagrid-okta-app-group-updater]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.okta_app_group_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
        EOT -> null
        id                   = "fb06c549e1e895bd4cd2bb65d4ec43f4e085d936"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dynamodb_tables.aws_dynamodb_table.access_requests will be created
  + resource "aws_dynamodb_table" "access_requests" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "request_id"
      + id               = (known after apply)
      + name             = "hagrid-access-requests"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"    = "hagrid-access-requests"
          + "Purpose" = "Track all access requests and their status"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-access-requests"
          + "Project"   = "hagrid"
          + "Purpose"   = "Track all access requests and their status"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "created_at"
          + type = "S"
        }
      + attribute {
          + name = "request_id"
          + type = "S"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "status"
          + name               = "status-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "created_at"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "user-requests-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "created_at"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.dynamodb_tables.aws_dynamodb_table.approval_messages will be created
  + resource "aws_dynamodb_table" "approval_messages" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "approval_message_id"
      + id               = (known after apply)
      + name             = "hagrid-approval-messages"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"    = "hagrid-approval-messages"
          + "Purpose" = "Track approval DMs sent to approvers"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-approval-messages"
          + "Project"   = "hagrid"
          + "Purpose"   = "Track approval DMs sent to approvers"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "approval_message_id"
          + type = "S"
        }
      + attribute {
          + name = "approver_email"
          + type = "S"
        }
      + attribute {
          + name = "request_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "request_id"
          + name               = "request-approvals-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "approver_email"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.dynamodb_tables.aws_dynamodb_table.conversations will be created
  + resource "aws_dynamodb_table" "conversations" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "conversation_id"
      + id               = (known after apply)
      + name             = "hagrid-conversations"
      + range_key        = "message_index"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"    = "hagrid-conversations"
          + "Purpose" = "Store message history for AI context preservation"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-conversations"
          + "Project"   = "hagrid"
          + "Purpose"   = "Store message history for AI context preservation"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "conversation_id"
          + type = "S"
        }
      + attribute {
          + name = "message_index"
          + type = "N"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "expires_at"
          + enabled        = true
        }
    }

  # module.okta_app_group_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/okta_app_group_lambda/placeholder.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
            EOT
          + filename = "index.py"
        }
    }

  # module.okta_app_group_lambda.aws_lambda_function.okta_app_group_updater is tainted, so must be replaced
-/+ resource "aws_lambda_function" "okta_app_group_updater" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater" -> (known after apply)
      ~ code_sha256                    = "zn5WHkTSoDeCjf6pS2MkIGoCpLIlqM5AN8Zgq+0d5hw=" -> (known after apply)
      ~ id                             = "hagrid-okta-app-group-updater" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater/invocations" -> (known after apply)
      ~ last_modified                  = "2025-12-30T18:51:15.000+0000" -> (known after apply)
      - layers                         = [
          - "arn:aws:lambda:us-east-2:949134893249:layer:okta-layer-python:1",
        ] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater:$LATEST/invocations" -> (known after apply)
      ~ runtime                        = "python3.11" -> "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "KPuCyhn23iUmFTBu5sHOTH4p15RK8MX+Q+vaNXQO1Mg=" -> (known after apply)
      ~ source_code_size               = 3140 -> (known after apply)
        tags                           = {
            "Name" = "hagrid-okta-app-group-updater"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hagrid-okta-app-group-updater" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.okta_app_group_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/okta_app_group_lambda/placeholder/index.py"
      + id                   = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + access_requests_table_arn       = (known after apply)
  + access_requests_table_name      = "hagrid-access-requests"
  + approval_messages_table_arn     = (known after apply)
  + approval_messages_table_name    = "hagrid-approval-messages"
  + conversations_table_arn         = (known after apply)
  + conversations_table_name        = "hagrid-conversations"
  + lambda_function_arn             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @m0liere, Action: `pull_request`*